MISC/2023-03-14-memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-14 Tue 01:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Op.103 登録</title>
<meta name="author" content="和田勇" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Op.103 登録</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org46b6776">1. 概要</a></li>
<li><a href="#org2240402">2. パッチ適用</a></li>
<li><a href="#org698b2f9">3. ステータスチェック</a>
<ul>
<li><a href="#orgc8b02c4">3.1. コマンド</a></li>
<li><a href="#org98f39ef">3.2. 結果の例</a></li>
</ul>
</li>
<li><a href="#orgb232afe">4. 追加したものを管理対象に登録</a>
<ul>
<li><a href="#org1f75a7e">4.1. 管理対象に登録作業</a></li>
</ul>
</li>
<li><a href="#org746d91b">5. 差分確認</a>
<ul>
<li><a href="#orgda873bc">5.1. コマンド</a></li>
<li><a href="#org5f49595">5.2. 表示結果例</a></li>
</ul>
</li>
<li><a href="#org55a7155">6. ビルド確認</a>
<ul>
<li><a href="#org53492fc">6.1. 過去の中間ファイル削除</a></li>
<li><a href="#org1ed6cd3">6.2. ビルド</a></li>
<li><a href="#orgc5eb420">6.3. pdf を表示して Op,103 が収録されているか簡単なチェックを行う</a></li>
</ul>
</li>
<li><a href="#org66b3b87">7. コミット</a></li>
</ul>
</div>
</div>

<div id="outline-container-org46b6776" class="outline-2">
<h2 id="org46b6776"><span class="section-number-2">1.</span> 概要</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>ファイル名 &#x2026; Brahms-section-Op.103.tex

<ul class="org-ul">
<li>Sxxxx は梅ヶ丘の Web 掲載用のものなので、S2560 はすでに別のもので使用されていることもあり、使用しないことにした。</li>

<li>八つに分割されていたがタイトル名が同じなので一つのファイル名にした</li>
</ul></li>
<li>Brahms.html への組み込み
<ul class="org-ul">
<li>2023-03-05 での挿入状況を考慮した</li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-org2240402" class="outline-2">
<h2 id="org2240402"><span class="section-number-2">2.</span> パッチ適用</h2>
<div class="outline-text-2" id="text-2">
<p>
メールに添付されたパッチの適用作業を行なってください。
</p>

<pre class="example">
git apply  ../../2023-03-14.patch
</pre>
</div>
</div>

<div id="outline-container-org698b2f9" class="outline-2">
<h2 id="org698b2f9"><span class="section-number-2">3.</span> ステータスチェック</h2>
<div class="outline-text-2" id="text-3">
<p>
パッチ適用で変更されたファイルや追加情報を確かめてください
</p>
</div>

<div id="outline-container-orgc8b02c4" class="outline-3">
<h3 id="orgc8b02c4"><span class="section-number-3">3.1.</span> コマンド</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
git status
</pre>
</div>
</div>

<div id="outline-container-org98f39ef" class="outline-3">
<h3 id="org98f39ef"><span class="section-number-3">3.2.</span> 結果の例</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
On branch phase-1
Changes not staged for commit:
  (use "git add &lt;file&gt;..." to update what will be committed)
  (use "git restore &lt;file&gt;..." to discard changes in working directory)
    modified:   Brahms.tex

Untracked files:  ←←追加されたので untracked （管理外）状態
  (use "git add &lt;file&gt;..." to include in what will be committed)
    Brahms-section-Op.103.tex

no changes added to commit (use "git add" and/or "git commit -a")
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb232afe" class="outline-2">
<h2 id="orgb232afe"><span class="section-number-2">4.</span> 追加したものを管理対象に登録</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1f75a7e" class="outline-3">
<h3 id="org1f75a7e"><span class="section-number-3">4.1.</span> 管理対象に登録作業</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
git add Brahms-section-Op.103.tex
</pre>
</div>
</div>
</div>

<div id="outline-container-org746d91b" class="outline-2">
<h2 id="org746d91b"><span class="section-number-2">5.</span> 差分確認</h2>
<div class="outline-text-2" id="text-5">
<p>
理状態のもののみで前回との差分があるもの把握可能
</p>
</div>

<div id="outline-container-orgda873bc" class="outline-3">
<h3 id="orgda873bc"><span class="section-number-3">5.1.</span> コマンド</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
git diff
</pre>
</div>
</div>

<div id="outline-container-org5f49595" class="outline-3">
<h3 id="org5f49595"><span class="section-number-3">5.2.</span> 表示結果例</h3>
<div class="outline-text-3" id="text-5-2">
<pre class="example">
diff --git
a/Brahms.tex b/Brahms.tex
index 8330ad0..8506348 100644
--- a/Brahms.tex
+++ b/Brahms.tex
@@ -83,6 +83,7 @@
 \input{Brahms/Brahms-section-29.tex}
 \input{Brahms/Brahms-section-30.tex}
 \input{Brahms/Brahms-section-31.tex}
+\input{Brahms/Brahms-section-Op.103.tex}
 \input{Brahms/Brahms-section-32.tex}
 \input{Brahms/Brahms-section-33.tex}
 \input{Brahms/Brahms-section-34.tex}
</pre>
</div>
</div>
</div>

<div id="outline-container-org55a7155" class="outline-2">
<h2 id="org55a7155"><span class="section-number-2">6.</span> ビルド確認</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org53492fc" class="outline-3">
<h3 id="org53492fc"><span class="section-number-3">6.1.</span> 過去の中間ファイル削除</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
llmk -C Brahms/Brahms
</pre>
</div>
</div>

<div id="outline-container-org1ed6cd3" class="outline-3">
<h3 id="org1ed6cd3"><span class="section-number-3">6.2.</span> ビルド</h3>
<div class="outline-text-3" id="text-6-2">
<pre class="example">
llmk    Brahms/Brahms ...
</pre>
</div>
</div>

<div id="outline-container-orgc5eb420" class="outline-3">
<h3 id="orgc5eb420"><span class="section-number-3">6.3.</span> pdf を表示して Op,103 が収録されているか簡単なチェックを行う</h3>
<div class="outline-text-3" id="text-6-3">
<p>
前回の PDF があれば diff-pd で比較してみる
</p>
</div>
</div>
</div>

<div id="outline-container-org66b3b87" class="outline-2">
<h2 id="org66b3b87"><span class="section-number-2">7.</span> コミット</h2>
<div class="outline-text-2" id="text-7">
<p>
Op,103 の登録は、大きなイベントなので、
ビルドが成功したら今回は禁を破って commit します
</p>

<pre class="example">
git commit -m 'add Op.103 追加' Brahms.tex Brahms-section-Op.103.tex
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 和田勇</p>
<p class="date">Created: 2023-03-14 Tue 01:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>